Projects/First_Benchmark/output/logs/varchar_queries_length_select_sysbench.log
sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Running the test with following options:
Number of threads: 8
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 8 tps: 28.79 qps: 28.79 (r/w/o: 28.79/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 8 tps: 29.19 qps: 29.19 (r/w/o: 29.19/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 29.39 qps: 29.39 (r/w/o: 29.39/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 29.80 qps: 29.80 (r/w/o: 29.80/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 8 tps: 29.40 qps: 29.40 (r/w/o: 29.40/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 29.62 qps: 29.62 (r/w/o: 29.62/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 8 tps: 29.81 qps: 29.81 (r/w/o: 29.81/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 29.20 qps: 29.20 (r/w/o: 29.20/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 8 tps: 29.58 qps: 29.58 (r/w/o: 29.58/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 29.42 qps: 29.42 (r/w/o: 29.42/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 8 tps: 29.99 qps: 29.99 (r/w/o: 29.99/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 29.20 qps: 29.20 (r/w/o: 29.20/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1775
        write:                           0
        other:                           0
        total:                           1775
    transactions:                        1775   (29.48 per sec.)
    queries:                             1775   (29.48 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.2093s
    total number of events:              1775

Latency (ms):
         min:                                  216.75
         avg:                                  271.13
         max:                                  362.90
         95th percentile:                        0.00
         sum:                               481258.94

Threads fairness:
    events (avg/stddev):           221.8750/1.27
    execution time (avg/stddev):   60.1574/0.04