Projects/First_Benchmark/output/logs/varchar_queries_select_sysbench.log
sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Running the test with following options:
Number of threads: 8
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 8 tps: 146.84 qps: 146.84 (r/w/o: 146.84/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 8 tps: 149.91 qps: 149.91 (r/w/o: 149.91/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 149.82 qps: 149.82 (r/w/o: 149.82/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 149.35 qps: 149.35 (r/w/o: 149.35/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 8 tps: 150.14 qps: 150.14 (r/w/o: 150.14/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 149.10 qps: 149.10 (r/w/o: 149.10/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 8 tps: 150.01 qps: 150.01 (r/w/o: 150.01/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 149.87 qps: 149.87 (r/w/o: 149.87/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 8 tps: 149.41 qps: 149.41 (r/w/o: 149.41/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 149.20 qps: 149.20 (r/w/o: 149.20/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 8 tps: 148.46 qps: 148.46 (r/w/o: 148.46/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 149.40 qps: 149.40 (r/w/o: 149.40/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            8966
        write:                           0
        other:                           0
        total:                           8966
    transactions:                        8966   (149.33 per sec.)
    queries:                             8966   (149.33 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0399s
    total number of events:              8966

Latency (ms):
         min:                                   42.93
         avg:                                   53.56
         max:                                  110.31
         95th percentile:                        0.00
         sum:                               480180.60

Threads fairness:
    events (avg/stddev):           1120.7500/3.93
    execution time (avg/stddev):   60.0226/0.01