Projects/First_Benchmark/output/logs/varchar_queries_sysbench.log
sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Tables KUNDENMITVARCHAR and BESTELLUNGMITVARCHAR have been successfully created.
sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Running the test with following options:
Number of threads: 4
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 4 tps: 0.00 qps: 18447.01 (r/w/o: 0.00/4611.75/13835.25) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 4 tps: 0.80 qps: 19675.46 (r/w/o: 0.80/4528.43/15146.23) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 4 tps: 0.00 qps: 23356.03 (r/w/o: 0.00/4379.63/18976.40) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 0.80 qps: 21852.40 (r/w/o: 0.80/4089.05/17762.55) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 4 tps: 0.80 qps: 21224.95 (r/w/o: 0.80/3982.50/17241.65) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 0.00 qps: 23267.25 (r/w/o: 0.00/4363.58/18903.67) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 4 tps: 0.80 qps: 21192.88 (r/w/o: 0.80/3972.42/17219.67) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 0.80 qps: 20275.20 (r/w/o: 0.80/3804.95/16469.45) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 4 tps: 0.00 qps: 22493.19 (r/w/o: 0.00/4213.83/18279.37) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 0.80 qps: 20765.96 (r/w/o: 0.80/3896.97/16868.19) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 4 tps: 0.80 qps: 19129.57 (r/w/o: 0.80/3591.35/15537.42) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 0.00 qps: 22972.46 (r/w/o: 0.00/4303.44/18669.02) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            32
        write:                           249805
        other:                           1029435
        total:                           1279272
    transactions:                        32     (0.52 per sec.)
    queries:                             1279272 (20835.79 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          61.3971s
    total number of events:              32

Latency (ms):
         min:                                 7109.84
         avg:                                 7667.01
         max:                                 8663.09
         95th percentile:                        0.00
         sum:                               245344.20

Threads fairness:
    events (avg/stddev):           8.0000/0.00
    execution time (avg/stddev):   61.3361/0.04

sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Cleanup sucessfully done